Tekla Open API Reference for Tekla Structures 2025
Distance.ConvertTo Method
 Converts the distance to the specified units.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ConvertTo(
	Distance.UnitType unitType
)
Public Function ConvertTo (
	unitType As Distance.UnitType
) As Double
Parameters
unitType
Type: Tekla.Structures.Datatype.Distance.UnitType
The distance unit type.
Return Value
Type: Double
The distance in the specified units.
Examples
 This example shows how to convert a Distance instance into real world units.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           double distanceInInches = distance.ConvertTo(Distance.UnitType.Inch);
       }
}
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace